<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Company;
use App\Models\ComplaintType;
use App\Models\ComplaintSub;
use App\Models\ComplaintMethod;
use App\Models\ComplaintPerson;
use App\Models\ComplaintSeverity;
use App\Models\Question;
use App\Models\CommentType;
use App\Models\CommentSub;

class ComplaintSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        $company = Company::where('id',1)->first();
        if(empty($company)){
            Company::create([
                'id' => 1,
                'name' => 'กรมสุขภาพจิต',
                'key_title' => 'SEC',
                'address' => '',
                'email' => 'pr.sec@dmh.mail.go.th',
                'dead_date_send' => 2,
                'dead_date_receive' => 10,
                'dead_date_answer' => 30,
                'dead_date_finish' => 2,
                'conditions' => '<p>1. ใช้ถ้อยคำหรือข้อความที่สุภาพ และต้องมี&nbsp;<br />- วัน เดือน ปี&nbsp;<br />- ชื่อ ที่อยู่ หมายเลขโทรศัพท์ อีเมล์ที่สามารถติดต่อถึงผู้ร้องเรียนได้&nbsp;<br />- ข้อเท็จจริง หรือ พฤติการณ์ของเรื่องที่ร้องเรียนได้อย่างชัดเจนว่าได้รับ ความเดือดร้อนหรือเสียหายอย่างไร ช่วงเวลาการกระทำผิดพฤติการณ์ทุจริตและประพฤติมิชอบ ต้องการให้แก้ไข ดำเนินการอย่างไร หรือ ชี้ช่องทางแจ้งเบาะแสเกี่ยวกับการทุจริตของเจ้าหน้าที่/หน่วยงานของกรมได้ชัดแจ้งเพียงพอที่สามารถดำเนินการสืบสวน&nbsp;สอบสวนได้&nbsp;<br />- ระบุ พยาน เอกสาร พยานวัตถุ และพยานบุคคล (ถ้ามี)&nbsp;<br />2. เรื่องร้องเรียนต้องเป็นเรื่องจริงที่มีมูลเหตุ มิได้หวังสร้างกระแสหรือสร้างข่าวที่เสียหายต่อบุคคล&nbsp;<br />3. การใช้บริการร้องเรียนของกรมฯ นั้น ต้องสามารถติดต่อกลับไปยังผู้ใช้บริการได้ เพื่อยืนยันว่ามีตัวตนจริง ไม่ได้สร้างเรื่องเพื่อกล่าวหาบุคคลอื่นหรือหน่วยงานต่างๆ ให้เกิดความเสียหาย&nbsp;<br />4. เป็นเรื่องที่ผู้ร้องได้รับความเดือดร้อน หรือเสียหาย อันเนื่องมาจากการปฏิบัติหน้าที่ต่างๆ ของเจ้าหน้าที่หรือหน่วงงานภายในสังกัดกรมสุขภาพจิต&nbsp;<br />5. เป็นเรื่องที่ประสงค์ขอให้กรมสุขภาพจิตช่วยเหลือหรือขจัดความเดือดร้อน ในด้านที่เกี่ยวข้องกับความรับผิดชอบหรือภารกิจของกรมฯ โดยตรง&nbsp;<br />6. เรื่องร้องเรียนที่มีข้อมูลไม่ครบถ้วน ไม่เพียงพอ หรือไม่สามารถหาข้อมูลเพิ่มเติมได้ในการดำเนินการตรวจสอบ สืบสวน สอบสวน ข้อเท็จจริง ตามรายละเอียดที่กล่าวมาในข้อที่ 1 นั้น จะยุติเรื่องทันที&nbsp;<br />7. ไม่เป็นเรื่องร้องเรียนที่เข้าลักษณะดังต่อไปนี้&nbsp;<br />- เรื่องร้องเรียนที่เป็นบัตรสนเท่ห์ เว้นแต่บัตรสนเท่ห์นั้นจะระบุรายละเอียดตามข้อที่ 1 นั้น จึงจะรับไว้พิจารณาเป็นการเฉพาะเรื่อง&nbsp;<br />- เรื่องร้องเรียนที่เข้าสู่กระบวนการยุติธรรมแล้ว หรือเป็นเรื่องที่ศาลได้มีคำสั่งพิพากษาหรือคำสั่งถึงที่สุดแล้ว&nbsp;<br />- เรื่องร้องเรียนที่เกี่ยวข้องกับสถาบันพระมหากษัตริย์&nbsp;<br />- เรื่องร้องเรียนที่เกี่ยวข้องกับนโยบายของรัฐบาล&nbsp;<br />- เรื่องร้องเรียนที่หน่วยงานอื่นได้ดำเนินการตรวจสอบ พิจารณาวินิจฉัย และได้มีข้อสรุปผลการพิจารณาเป็นที่เรียบร้อยไปแล้ว&nbsp;</p><ul><li>ข้าพเจ้าขอรับรองว่าข้อเท็จจริงที่ได้ยื่นร้องเรียนต่อกรมสุขภาพจิตเป็นเรื่องที่เกิดขึ้นจริงทั้งหมดและขอรับผิดชอบต่อข้อเท็จจริงดังกล่าวข้างต้นทุกประการ</li><li>การนำความเท็จมาร้องเรียนต่อเจ้าหน้าที่ ซึ่งทำให้ผู้อื่นได้รับความเสียหายอาจเป็นความผิดฐานแจ้งความเท็จต่อเจ้าพนักงานตามประมวลกฎหมายอาญา</li><li>กรมสุขภาพจิตมีการคุ้มครองข้อมูลของผู้ที่แจ้งเบาะแสผ่านช่องทางแจ้งเรื่องร้องเรียนการทุจริตและประพฤติมิชอบ</li></ul>',
            ]);
            echo "Company create successfull."."\n";
        }else{
            $company->update([
                'name' => 'กรมสุขภาพจิต',
                'key_title' => 'SEC',
                'address' => '',
                'email' => 'pr.sec@dmh.mail.go.th',
                'dead_date_send' => 2,
                'dead_date_receive' => 10,
                'dead_date_answer' => 30,
                'dead_date_finish' => 2,
                'conditions' => '<p>1. ใช้ถ้อยคำหรือข้อความที่สุภาพ และต้องมี&nbsp;<br />- วัน เดือน ปี&nbsp;<br />- ชื่อ ที่อยู่ หมายเลขโทรศัพท์ อีเมล์ที่สามารถติดต่อถึงผู้ร้องเรียนได้&nbsp;<br />- ข้อเท็จจริง หรือ พฤติการณ์ของเรื่องที่ร้องเรียนได้อย่างชัดเจนว่าได้รับ ความเดือดร้อนหรือเสียหายอย่างไร ช่วงเวลาการกระทำผิดพฤติการณ์ทุจริตและประพฤติมิชอบ ต้องการให้แก้ไข ดำเนินการอย่างไร หรือ ชี้ช่องทางแจ้งเบาะแสเกี่ยวกับการทุจริตของเจ้าหน้าที่/หน่วยงานของกรมได้ชัดแจ้งเพียงพอที่สามารถดำเนินการสืบสวน&nbsp;สอบสวนได้&nbsp;<br />- ระบุ พยาน เอกสาร พยานวัตถุ และพยานบุคคล (ถ้ามี)&nbsp;<br />2. เรื่องร้องเรียนต้องเป็นเรื่องจริงที่มีมูลเหตุ มิได้หวังสร้างกระแสหรือสร้างข่าวที่เสียหายต่อบุคคล&nbsp;<br />3. การใช้บริการร้องเรียนของกรมฯ นั้น ต้องสามารถติดต่อกลับไปยังผู้ใช้บริการได้ เพื่อยืนยันว่ามีตัวตนจริง ไม่ได้สร้างเรื่องเพื่อกล่าวหาบุคคลอื่นหรือหน่วยงานต่างๆ ให้เกิดความเสียหาย&nbsp;<br />4. เป็นเรื่องที่ผู้ร้องได้รับความเดือดร้อน หรือเสียหาย อันเนื่องมาจากการปฏิบัติหน้าที่ต่างๆ ของเจ้าหน้าที่หรือหน่วงงานภายในสังกัดกรมสุขภาพจิต&nbsp;<br />5. เป็นเรื่องที่ประสงค์ขอให้กรมสุขภาพจิตช่วยเหลือหรือขจัดความเดือดร้อน ในด้านที่เกี่ยวข้องกับความรับผิดชอบหรือภารกิจของกรมฯ โดยตรง&nbsp;<br />6. เรื่องร้องเรียนที่มีข้อมูลไม่ครบถ้วน ไม่เพียงพอ หรือไม่สามารถหาข้อมูลเพิ่มเติมได้ในการดำเนินการตรวจสอบ สืบสวน สอบสวน ข้อเท็จจริง ตามรายละเอียดที่กล่าวมาในข้อที่ 1 นั้น จะยุติเรื่องทันที&nbsp;<br />7. ไม่เป็นเรื่องร้องเรียนที่เข้าลักษณะดังต่อไปนี้&nbsp;<br />- เรื่องร้องเรียนที่เป็นบัตรสนเท่ห์ เว้นแต่บัตรสนเท่ห์นั้นจะระบุรายละเอียดตามข้อที่ 1 นั้น จึงจะรับไว้พิจารณาเป็นการเฉพาะเรื่อง&nbsp;<br />- เรื่องร้องเรียนที่เข้าสู่กระบวนการยุติธรรมแล้ว หรือเป็นเรื่องที่ศาลได้มีคำสั่งพิพากษาหรือคำสั่งถึงที่สุดแล้ว&nbsp;<br />- เรื่องร้องเรียนที่เกี่ยวข้องกับสถาบันพระมหากษัตริย์&nbsp;<br />- เรื่องร้องเรียนที่เกี่ยวข้องกับนโยบายของรัฐบาล&nbsp;<br />- เรื่องร้องเรียนที่หน่วยงานอื่นได้ดำเนินการตรวจสอบ พิจารณาวินิจฉัย และได้มีข้อสรุปผลการพิจารณาเป็นที่เรียบร้อยไปแล้ว&nbsp;</p><ul><li>ข้าพเจ้าขอรับรองว่าข้อเท็จจริงที่ได้ยื่นร้องเรียนต่อกรมสุขภาพจิตเป็นเรื่องที่เกิดขึ้นจริงทั้งหมดและขอรับผิดชอบต่อข้อเท็จจริงดังกล่าวข้างต้นทุกประการ</li><li>การนำความเท็จมาร้องเรียนต่อเจ้าหน้าที่ ซึ่งทำให้ผู้อื่นได้รับความเสียหายอาจเป็นความผิดฐานแจ้งความเท็จต่อเจ้าพนักงานตามประมวลกฎหมายอาญา</li><li>กรมสุขภาพจิตมีการคุ้มครองข้อมูลของผู้ที่แจ้งเบาะแสผ่านช่องทางแจ้งเรื่องร้องเรียนการทุจริตและประพฤติมิชอบ</li></ul>',
            ]);
            echo "Company updated successfull."."\n";
        }

        $items = [
            [1,'การทุจริต',1,15,1,1],
            [2,'การปฏิบัติหรือละเว้นการปฏิบัติหน้าที่โดยมิชอบ',2,15,1,1],
            [3,'การไม่ปฏิบัติตามจรรยาข้าราชการกรมอนามัยฯ',3,15,1,1],
            [4,'การฝ่าฝืนประมวลจริยธรรม ขรก.พลเรือน',4,15,1,1],
            [5,'เหตุเดือดร้อนรำคาญ',5,15,1,1],
            [6,'ละเมิดสิทธิตามกฎหมาย (พรบ.สธ.)',6,15,1,1],
            [7,'การปฏิบัติไม่ถูกต้องตามหลักสุขาภิบาลอาหารฯ',7,15,1,1],
            [8,'จัดซื้อจัดจ้าง',8,15,1,1],
            [9,'ชมเชย',9,15,1,1],
            [10,'อื่นๆ',11,15,1,1],
            [11,'การให้บริการของเจ้าหน้าที่',10,15,1,1],
            // [12,'ข้อคิดเห็นและข้อเสนอแนะ',12,10,1,1],
            // [13,'คำชมเชย',13,10,1,1],
        ];
        foreach($items as $item){
            $chk = ComplaintType::where('id',$item[0])->first();
            if(empty($chk)){
                ComplaintType::create([
                    'id' => $item[0],
                    'name' => $item[1],
                    'num' => $item[2],
                    'time_span' => $item[3],
                    'type' => $item[4],
                    'com_group' => $item[5],
                ]);
                echo "Complaint Type ".$item[1]." create successfull."."\n";
            }else{
                $chk->update([
                    'name' => $item[1],
                    'num' => $item[2],
                    'time_span' => $item[3],
                    'type' => $item[4],
                    'com_group' => $item[5],
                ]);
                echo "Complaint Type ".$item[1]." updated successfull."."\n";
            }
        }

        $items = [
            
        ];
        foreach($items as $item){
            $chk = ComplaintSub::where('id',$item[0])->first();
            if(empty($chk)){
                ComplaintSub::create([
                    'id' => $item[0],
                    'name' => $item[1],
                    'complaint_type_id' => $item[2],
                    'num' => $item[3],
                    'time_span' => $item[4],
                    'type' => $item[5],
                ]);
                echo "Complaint Sub ".$item[1]." create successfull."."\n";
            }else{
                $chk->update([
                    'name' => $item[1],
                    'complaint_type_id' => $item[2],
                    'num' => $item[3],
                    'time_span' => $item[4],
                    'type' => $item[5],
                ]);
                echo "Complaint Sub ".$item[1]." updated successfull."."\n";
            }
        }

        $items = [
            [1, 'เว็บไซต์ของหน่วยงาน', 2, 1],
            [2, 'ร้องเรียนด้วยตนเอง', 3, 1],
            [3, 'ตู้รับความคิดเห็น', 4, 1],
            [4, 'จดหมาย', 5, 1],
            [5, 'โทรศัพท์', 6, 1],
            [6, 'อีเมล', 7, 1],
            [7, 'อื่น ๆ', 8, 1],
            [8, '1111', 9, 0],
            [9, 'ระบบ Satsurvey', 10, 1],
            [10, 'ระบบ E-Complaint', 1, 1],
        ];
        foreach($items as $item){
            $chk = ComplaintMethod::where('id',$item[0])->first();
            if(empty($chk)){
                ComplaintMethod::create([
                    'id' => $item[0],
                    'name' => $item[1],
                    'num' => $item[2],
                    'type' => $item[3],
                ]);
                echo "Complaint Method ".$item[1]." create successfull."."\n";
            }else{
                $chk->update([
                    'name' => $item[1],
                    'num' => $item[2],
                    'type' => $item[3],
                ]);
                echo "Complaint Method ".$item[1]." updated successfull."."\n";
            }
        }

        $items = [
            [1, 'แพทย์', 2, 1],
            [2, 'พยาบาล', 3, 1],
            [3, 'เจ้าหน้าที่', 4, 1],
            [4, 'อื่น ๆ', 5, 1],
            [5, 'ผู้อำนวยการ', 1, 1],
        ];
        foreach($items as $item){
            $chk = ComplaintPerson::where('id',$item[0])->first();
            if(empty($chk)){
                ComplaintPerson::create([
                    'id' => $item[0],
                    'name' => $item[1],
                    'num' => $item[2],
                    'type' => $item[3],
                ]);
                echo "Complaint Person ".$item[1]." create successfull."."\n";
            }else{
                $chk->update([
                    'name' => $item[1],
                    'num' => $item[2],
                    'type' => $item[3],
                ]);
                echo "Complaint Person ".$item[1]." updated successfull."."\n";
            }
        }

        $items = [
            [1, 'ผู้รับบริการเกิดความไม่พึงพอใจ จังทำให้เกิดข้อร้องเรียนทั่ว ๆ ไป', 1, 15, 1],
            [2, 'ผู้รับบริการเกิดความไม่พึงพอใจ จึงทำให้เกิดข้อร้องเรียน และน่าจะส่งผลให้หน่วยงานต้องมีการเจรจาต่อรองและทำความเข้าใจ', 2, 15, 1],
            [3, 'ผู้รับบริการเกิดความไม่พึงพอใจ จึงทำให้เกิดข้อร้องเรียน และน่าจะส่งผล ให้มีการเจรจาเพื่อปกป้องชื่อเสียงของหน่วยงานหรือกรม', 3, 12, 1],
            [4, 'ผู้รับบริการเกิดความไม่พึงพอใจ จึงทำให้เกิดการฟ้องร้องทางคดีความ', 4, 10, 1],
            [5, 'ผู้รับบริการเกิดความไม่พึงพอใจ และทำให้ส่งผลกระทบต่อชีวิต และความมั่นคงในการดำรงชีวิตในปัจจุบัน', 5, 7, 1],
        ];
        foreach($items as $item){
            $chk = ComplaintSeverity::where('id',$item[0])->first();
            if(empty($chk)){
                ComplaintSeverity::create([
                    'id' => $item[0],
                    'name' => $item[1],
                    'level' => $item[2],
                    'time' => $item[3],
                    'type' => $item[4],
                ]);
                echo "Complaint Severity ".$item[1]." create successfull."."\n";
            }else{
                $chk->update([
                    'name' => $item[1],
                    'level' => $item[2],
                    'time' => $item[3],
                    'type' => $item[4],
                ]);
                echo "Complaint Severity ".$item[1]." updated successfull."."\n";
            }
        }

        $items = [
            [1, 'ความพึงพอใจด้านการให้บริการ (การตอบสนองข้อร้องเรียน)', 1, 1],
            [2, 'ความพึงพอใจต่อการใช้งานระบบบริหารจัดการข้อคิดเห็นข้อร้องเรียน กรมสุขภาพจิต (ขั้นตอนการให้บริการ)', 2, 1],
            [3, 'ความพึงพอใจต่อการจัดการข้อคิดเห็นข้อร้องเรียน', 3, 1],
            [4, 'aaa', 4, 0],
            [5, 'ความพึงพอใจภาพรวมต่อระบบบริหารจัดการข้อคิดเห็นข้อร้องเรียน ', 5, 1],
        ];
        foreach($items as $item){
            $chk = Question::where('id',$item[0])->first();
            if(empty($chk)){
                Question::create([
                    'id' => $item[0],
                    'name' => $item[1],
                    'num' => $item[2],
                    'type' => $item[3],
                ]);
                echo "Question ".$item[1]." create successfull."."\n";
            }else{
                $chk->update([
                    'name' => $item[1],
                    'num' => $item[2],
                    'type' => $item[3],
                ]);
                echo "Question ".$item[1]." updated successfull."."\n";
            }
        }

        $items = [
            [1, 'ข้อคิดเห็นเกี่ยวกับการให้บริการ', 1, 2],
            [2, 'ข้อคิดเห็นเกี่ยวกับการบริหารจัดการ', 2, 2],
            [3, 'ข้อคิดเห็นเกี่ยวกับค่าตอบแทน', 3, 1],
            [4, 'ข้อคิดเห็นเกี่ยวกับวินัยข้าราชการ', 4, 1],
            [5, 'ข้อคิดเห็นเกี่ยวกับการทุจริตของเจ้าหน้าที่', 5, 1],
            [6, 'เรื่องอื่นๆ', 6, 1],
        ];
        foreach($items as $item){
            $chk = CommentType::where('id',$item[0])->first();
            if(empty($chk)){
                CommentType::create([
                    'id' => $item[0],
                    'name' => $item[1],
                    'num' => $item[2],
                    'type' => $item[3],
                ]);
                echo "Comment Type ".$item[1]." create successfull."."\n";
            }else{
                $chk->update([
                    'name' => $item[1],
                    'num' => $item[2],
                    'type' => $item[3],
                ]);
                echo "Comment Type ".$item[1]." updated successfull."."\n";
            }
        }

        $items = [
            [1, 'ด้านความรวดเร็ว', 1, 1, 1],
            [2, 'ด้านพฤติกรรมบริการ', 1, 2, 1],
            [3, 'ด้านสิ่งอํานวยความสะดวก', 1, 3, 1],
            [4, 'ด้านการบําบัดรักษา', 1, 4, 1],
            [5, 'ด้านการให้คําแนะนํา การให้ข้อมูล', 1, 5, 1],
            [6, 'ด้านการบริหารงานบุคคล', 2, 1, 1],
            [7, 'ด้านการบริหารงานพัสดุ', 2, 2, 1],
            [8, 'ด้านการบริหารงบประมาณ', 2, 3, 1],
        ];
        foreach($items as $item){
            $chk = CommentSub::where('id',$item[0])->first();
            if(empty($chk)){
                CommentSub::create([
                    'id' => $item[0],
                    'name' => $item[1],
                    'num' => $item[3],
                    'comment_type_id' => $item[2],
                    'type' => $item[4],
                ]);
                echo "Comment Sub ".$item[1]." create successfull."."\n";
            }else{
                $chk->update([
                    'name' => $item[1],
                    'num' => $item[3],
                    'comment_type_id' => $item[2],
                    'type' => $item[4],
                ]);
                echo "Comment Sub ".$item[1]." updated successfull."."\n";
            }
        }




        
    }
}
