<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Unit;

class UnitSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $items = [
            [1,'สํานักงานเลขานุการกรม','สลก.',1,1],
            [2,'กองบริหารการคลัง','กอง กค.',1,1],
            [3,'กองบริหารทรัพยากรบุคคล','กอง บค.',1,1],
            [4,'กองบริหารระบบบริการสุขภาพจิต','กบบส.',1,1],
            [5,'กองยุทธศาสตร์และแผนงาน','กยผ.',1,1],
            [6,'กองสุขภาพจิตสังคม','กอง สส.',1,0],
            [7,'โรงพยาบาลศรีธัญญา','รพ.ศญ.',1,1],
            [8,'ศูนย์สุขภาพจิตที่ 1','ศ.1',1,1],
            [9,'ศูนย์สุขภาพจิตที่ 2','ศ.2',1,1],
            [10,'ศูนย์สุขภาพจิตที่ 3','ศ.3',1,1],
            [11,'ศูนย์สุขภาพจิตที่ 4','ศ.4',1,1],
            [12,'ศูนย์สุขภาพจิตที่ 5','ศ.5',1,1],
            [13,'ศูนย์สุขภาพจิตที่ 6','ศ.6',1,1],
            [14,'ศูนย์สุขภาพจิตที่ 7','ศ.7',1,1],
            [15,'ศูนย์สุขภาพจิตที่ 8','ศ.8',2,1],
            [16,'ศูนย์สุขภาพจิตที่ 9','ศ.9',2,1],
            [17,'ศูนย์สุขภาพจิตที่ 10','ศ.10',2,1],
            [18,'ศูนย์สุขภาพจิตที่ 11','ศ.11',2,1],
            [19,'ศูนย์สุขภาพจิตที่ 12','ศ.12',2,1],
            [20,'สถาบันกัลยาณ์ราชนครินทร์','ส.กย.',2,1],
            [21,'สถาบันจิตเวชศาสตร์สมเด็จเจ้าพระยา','ส.สด.',2,1],
            [22,'สถาบันราชานุกูล','ส.รช.',2,1],
            [23,'กลุ่มตรวจสอบภายใน','ตสน.',2,1],
            [24,'กลุ่มพัฒนาระบบบริหาร','กพร.',2,1],
            [25,'กลุ่มคุ้มครองจริยธรรม','กคธ.',2,0],
            [26,'สํานักงานโครงการ TO BE NUMBER ONE','ทบ.',2,1],
            [27,'สำนักงานจริยธรรมการวิจัยในคนด้านสุขภาพจิตและจิตเวช','สวค.',2,0],
            [28,'กองส่งเสริมและพัฒนาสุขภาพจิต','กสพส.',1,1],
            [29,'โรงพยาบาลสวนปรุง','รพ.สป.',2,1],
            [30,'โรงพยาบาลสวนสราญรมย์','รพ.สร.',2,1],
            [31,'โรงพยาบาลพระศรีมหาโพธิ์','รพ.พศ.',1,1],
            [32,'โรงพยาบาลยุวประสาทไวทโยปถัมภ์','รพ.ยป.',2,1],
            [33,'โรงพยาบาลจิตเวชนครราชสีมาราชนครินทร์','รพจ.นม.',2,1],
            [34,'โรงพยาบาลจิตเวชสงขลาราชนครินทร์','รพจ.สข.',2,1],
            [35,'โรงพยาบาลจิตเวชขอนแก่นราชนครินทร์','รพจ.ขก.',3,1],
            [36,'โรงพยาบาลจิตเวชนครสวรรค์ราชนครินทร์','รพจ.นว.',3,1],
            [37,'โรงพยาบาลจิตเวชสระแก้วราชนครินทร์','รพจ.สก.',3,1],
            [38,'โรงพยาบาลจิตเวชเลยราชนครินทร์','รพจ.ลย.',2,1],
            [39,'โรงพยาบาลจิตเวชนครพนมราชนครินทร์','รพจ.นพ.',3,1],
            [40,'โรงพยาบาลจิตเวชพิษณุโลก','รพจ.พล.',3,1],
            [41,'สถาบันสุขภาพจิตเด็กและวัยรุ่นราชนครินทร์','สจ.ดว.',3,1],
            [42,'สถาบันพัฒนาการเด็กราชนครินทร์','ส.พนด.',3,1],
            [43,'สถาบันเด็กและวัยรุ่นภาคตะวันออกเฉียงเหนือ','สจ.ดฉ.',3,1],
            [44,'สถาบันสุขภาพจิตเด็กและวัยรุ่นภาคใต้','สจ.ดต.',3,1],
            [45,'ศูนย์สุขภาพจิตที่ 13','ศ.13',3,1],
            [46,'สำนักวิชาการสุขภาพจิต','',3,1],
            [47,'สำนักเทคโนโลยีสารสนเทศ','',3,1],
            [48,'สำนักงานวิเทศสัมพันธ์','',3,0],
            [49,'กรมสุขภาพจิต','',1,1],
            [50,'สำนักงานเลขานุการคณะกรรมการสุขภาพจิตแห่งชาติ (ลคสช)','ลคสช',1,1],
            [51,'สำนักความรอบรู้สุขภาพจิต','สคร.',1,1],
        ];

        foreach($items as $item){
            $chk = Unit::where('id',$item[0])->first();
            if(empty($chk)){
                Unit::create([
                    'id' => $item[0],
                    'name' => $item[1],
                    'short_name' => $item[2],
                    'area' => $item[3],
                    'type' => $item[4],
                ]);
                echo "Unit ".$item[1]." create successfull."."\n";
            }else{
                $chk->update([
                    'name' => $item[1],
                    'short_name' => $item[2],
                    'area' => $item[3],
                    'type' => $item[4],
                ]);
                echo "Unit ".$item[1]." updated successfull."."\n";
            }
        }
    }
}
