<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\User;
use Illuminate\Support\Facades\Hash;
use Illuminate\Support\Str;

class UserSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $items = [
            [1, 'admin','admin','admin','root'],
        ];

        foreach($items as $item){
            $chk = User::where('id',$item[0])->first();
            if(empty($chk)){
                User::create([
                    'id' => $item[0],
                    'username' => $item[1],
                    'password' => Hash::make($item[2]),
                    'name' => $item[3],
                    'level' => $item[4],
                ]);
                echo "User ".$item[1]." create successfull."."\n";
            }else{
                $chk->update([
                    'username' => $item[1],
                    'password' => Hash::make($item[2]),
                    'name' => $item[3],
                    'level' => $item[4],
                ]);
                echo "User ".$item[1]." updated successfull."."\n";
            }
        }

        /*
        $items2 = [
            [13,'070f5f85a9ffb005d05c21cd8f5f0dc0','secret01','f4e1498cbf20aa52897a19956332974d','เจ้าหน้าที่','สํานักงานเลขานุการกรม','','','','','user','1','','','','','2020-09-11 09:09:02','1'],
            [14,'5f74ef451b10b1459e03a5cf7a31e6cd','secret02','a73a5f0653af607dae81f9a7be6da5fd','เจ้าหน้าที่','กองบริหารการคลัง','','','','','user','2','','','','','2020-09-11 09:09:02','1'],
            [15,'d008d6cab88a8ba6bc09e5d887a2abfc','secret03','07d0ad7f1ab59d186c488b8fc0a2d243','เจ้าหน้าที่','กองบริหารทรัพยากรบุคคล','','','','','user','3','','','','','2020-09-11 09:09:02','1'],
            [16,'4a1ade6cca340dd83a6f232b4266e2a8','secret04','54fd116f35f42738124cf587a6d98a04','เจ้าหน้าที่','กองบริหารระบบบริการสุขภาพจิต','','','','','user','4','','','','','2020-09-11 09:09:02','1'],
            [17,'648483054f31be12eb8f98976864edbf','secret05','71ccc4ace0b7c9707e2e4addbc667888','เจ้าหน้าที่','กองยุทธศาสตร์และแผนงาน','','','','','user','5','','','','','2020-09-11 09:09:02','1'],
            [18,'818e749ad7341d6bf54772f50536baf4','secret06','b04fbea31dea86b5ea5bbc610bb8583c','เจ้าหน้าที่','กองสุขภาพจิตสังคม','','','','','user','6','','','','','2020-09-11 09:09:02','0'],
            [19,'99a6bc4b724873b8414a04e467a7f463','secret07','054ec1e4cdb26b7a6156b2cacf59f2b5','เจ้าหน้าที่','โรงพยาบาลศรีธัญญา','','','','','user','7','','','','','2020-09-11 09:09:02','1'],
            [20,'d7b353a98a55b31c790b7a7561d562e0','secret08','0b0b838eef8dc1e1efdd3d43433fc4c6','เจ้าหน้าที่','ศูนย์สุขภาพจิตที่ 1','','','','','user','8','','','','','2020-09-11 09:09:02','1'],
            [21,'b940f8dcb114017f4dc9c656dc0f2976','secret09','439fe23dd0f541bb855ce2998cc40a21','เจ้าหน้าที่','ศูนย์สุขภาพจิตที่ 2','','','','','user','9','','','','','2020-09-11 09:09:02','1'],
            [22,'54d14f0af67629b009dc6ea066b81d2a','secret10','534ccde60e9d38de4e7d85a20483c73e','เจ้าหน้าที่','ศูนย์สุขภาพจิตที่ 3','','','','','user','10','','','','','2020-09-11 09:09:02','1'],
            [23,'3d85820264d42d310e28f85cddf800be','secret11','b2e16384c8822b01865cd2f2f918146e','เจ้าหน้าที่','ศูนย์สุขภาพจิตที่ 4','','','','','user','11','','','','','2020-09-11 09:09:02','1'],
            [24,'229e9c0e93b643385caf156e8765e75d','secret12','e9a5fe64cdac0adcb2c7b6fdc30d2688','เจ้าหน้าที่','ศูนย์สุขภาพจิตที่ 5','','','','','user','12','','','','','2020-09-11 09:09:02','1'],
            [25,'c66e9f7498b7cea5743f6383e15dbe8b','secret13','55c7dfe8e0c356284cb9fa65736c7558','เจ้าหน้าที่','ศูนย์สุขภาพจิตที่ 6','','','','','user','13','','','','','2020-09-11 09:09:02','1'],
            [26,'e4ee6e836f98cae9ef97fae0d557f296','secret14','00e5e1b5be58a3de449680e9f5108c8d','เจ้าหน้าที่','ศูนย์สุขภาพจิตที่ 7','','','','','user','14','','','','','2020-09-11 09:09:02','1'],
            [27,'acbf3321dec8cde2c37fd7d5a262efc1','secret15','b47c131eec227bae754d6c94eb134a26','เจ้าหน้าที่','ศูนย์สุขภาพจิตที่ 8','','','','','user','15','','','','','2020-09-11 09:09:02','1'],
            [28,'2cd08d0a41fbb35cd593a12720df50b6','secret16','bfd41eca481e03bb35608f16392d1ac1','เจ้าหน้าที่','ศูนย์สุขภาพจิตที่ 9','','','','','user','16','','','','','2020-09-11 09:09:02','1'],
            [29,'0f15f2c83c0be43a6b4ba0faa67ccd97','secret17','9c75e64f1d7f360aea298674c8d47837','เจ้าหน้าที่','ศูนย์สุขภาพจิตที่ 10','','','','','user','17','','','','','2020-09-11 09:09:02','1'],
            [30,'dfbf76e346de517eac86100203f0cbfd','secret18','791aa9f5c3f757dfd287678d7a5edb74','เจ้าหน้าที่','ศูนย์สุขภาพจิตที่ 11','','','','','user','18','','','','','2020-09-11 09:09:02','1'],
            [31,'612b9229c6df1c1f98990b605f0afcff','secret19','5637b7b85e264e1dcd3a391aae0d88d0','เจ้าหน้าที่','ศูนย์สุขภาพจิตที่ 12','','','','','user','19','','','','','2020-09-11 09:09:02','1'],
            [32,'210c080c3b0563f0c84fb76c7f60d981','secret20','65aaa86dd76e776ff3fce812ee1bf835','เจ้าหน้าที่','สถาบันกัลยาณ์ราชนครินทร์','','','','','user','20','','','','','2020-09-11 09:09:02','1'],
            [33,'82850f29f4f24b5cadbb658bf7110852','secret21','379a7912330951f5b55301e23baeb138','เจ้าหน้าที่','สถาบันจิตเวชศาสตร์สมเด็จเจ้าพระยา','','','','','user','21','','','','','2020-09-11 09:09:02','1'],
            [34,'c6d0547b3474f818e11ec11ae7d5ad23','secret22','14312e433730e46307545d4b403545c0','เจ้าหน้าที่','สถาบันราชานุกูล','','','','','user','22','','','','','2020-09-11 09:09:02','1'],
            [35,'020bc1b843980b521984133fe416a241','secret23','bf9af791df43344a9c8f34378a2ceb45','เจ้าหน้าที่','กลุ่มตรวจสอบภายใน','','','','','user','23','','','','','2020-09-11 09:09:02','1'],
            [36,'2a08a247e1751a701db589ae328b23e1','secret24','4d3b6d64284fa4889a4f9882ce32ef96','เจ้าหน้าที่','กลุ่มพัฒนาระบบบริหาร','','','','','user','24','','','','','2020-09-11 09:09:02','1'],
            [37,'32d2e24f36bfaf4c37fbccf6887075f4','secret25','85838cf3355e2a930b5d5ff0441d4c74','เจ้าหน้าที่','กลุ่มคุ้มครองจริยธรรม','','','','','user','25','','','','','2020-09-11 09:09:02','0'],
            [38,'38f27073de51059971db30a867208797','secret26','9db42aa330c66a6d703eb64d3ae61443','เจ้าหน้าที่','สํานักงานโครงการ TO BE NUMBER ONE','','','','','user','26','','','','','2020-09-11 09:09:02','1'],
            [39,'31e3acaa8f7148718718795855fa3d6e','secret27','150697c779385bc92e9fe5059187cdf7','เจ้าหน้าที่','สำนักงานจริยธรรมการวิจัยในคนด้านสุขภาพจิตและจิตเวช','','','','','user','27','','','','','2020-09-11 09:09:02','0'],
            [40,'f2075802b09d1d7332fa4f657bf9cdc8','secret28','115fd68bf6b856c63fe048576616ff2f','เจ้าหน้าที่','สำนักส่งเสริมและพัฒนาสุขภาพจิต','','','','','user','28','','','','','2020-09-11 09:09:02','1'],
            [41,'d5524a39a5eeaf04b87797018ee83f1e','secret29','03004154f218a81e6a920a8ca2291bf4','เจ้าหน้าที่','โรงพยาบาลสวนปรุง','','','','','user','29','','','','','2020-09-11 09:09:02','1'],
            [42,'2da0b84de3e5b724e7cb62e2d47966fb','secret30','61d72172a8ac50a421d126604fea5363','เจ้าหน้าที่','โรงพยาบาลสวนสราญรมย์','','','','','user','30','','','','','2020-09-11 09:09:02','1'],
            [43,'3d4fc7ad107664943136d4c062b22884','secret31','706b04302b9db67417597c066646735a','เจ้าหน้าที่','โรงพบาบาลพระศรีมหาโพธิ์','','','','','user','31','','','','','2020-09-11 09:09:02','1'],
            [44,'61d30afc91095caaae315b437a227a32','secret32','cda8bc0840ace5348b7b067cf5b64690','เจ้าหน้าที่','โรงพยาบาลยุวประสาทไวทโยปถัมภ์','','','','','user','32','','','','','2020-09-11 09:09:02','1'],
            [45,'c3a1dcb5af97d0d7cb29cf181f6c6118','secret33','519480fef1fed265f19ef84e214cd6d6','เจ้าหน้าที่','โรงพยาบาลจิตเวชนครราชสีมาราชนครินทร์','','','','','user','33','','','','','2020-09-11 09:09:02','1'],
            [46,'31be376e2cc8f489ed9929f7256d248b','secret34','4e5380b4b3e13db59bec57f2f0cd6847','เจ้าหน้าที่','โรงพยาบาลจิตเวชสงขลาราชนครินทร์','','','','','user','34','','','','','2020-09-11 09:09:02','1'],
            [47,'a155d9ab07da5b0985b3077cf2e83222','secret35','d4e9c1ed1e40b90a467f9a8c1c93b68f','เจ้าหน้าที่','โรงพยาบาลจิตเวชขอนแก่นราชนครินทร์','','','','','user','35','','','','','2020-09-11 09:09:02','1'],
            [48,'5c7cf15e26487ad2577f1c6a67a563a6','secret36','1bb528a571d03e9bf3a2b76915f0a057','เจ้าหน้าที่','โรงพยาบาลจิตเวชนครสวรรค์ราชนครินทร์','','','','','user','36','','','','','2020-09-11 09:09:02','1'],
            [49,'a0f57efb5e702ac61de41ce72857168f','secret37','5d58c365c2d4461e1c8fd334e68a87f7','เจ้าหน้าที่','โรงพยาบาลจิตเวชสระแก้วราชนครินทร์','','','','','user','37','','','','','2020-09-11 09:09:02','1'],
            [50,'ca51acde6a02a6cc20c5f723fbe46649','secret38','c9a70541693b160f2062e2804a2632bc','เจ้าหน้าที่','โรงพยาบาลจิตเวชเลยราชนครินทร์','000-000-0000','00-000-0000','a@gmail.com','','user','38','','','','','2020-09-11 09:09:02','1'],
            [51,'26f2f2b26056e6274990569bf6c21a4c','secret39','e879b297b05cd293a74054ff8e0b3e63','เจ้าหน้าที่','โรงพยาบาลจิตเวชนครพนมราชนครินทร์','','','','','user','39','','','','','2020-09-11 09:09:02','1'],
            [52,'f818ef04a0f0295819912681d24aa871','secret40','90a274ea949bfc90074f4bb8dd80cdca','เจ้าหน้าที่','โรงพยาบาลจิตเวชพิษณุโลก','','','','','user','40','','','','','2020-09-11 09:09:02','1'],
            [53,'cb59475d0694e387ec1118b0be654587','secret41','fef82c66603877b6717c1bcf6ace3950','เจ้าหน้าที่','สถาบันสุขภาพจิตเด็กและวัยรุ่นราชนครินทร์','','','','','user','41','','','','','2020-09-11 09:09:02','1'],
            [54,'7c94790953c4719bfa38003dc469bdce','secret42','88b9d5a9370de7f090658c8955d42c86','เจ้าหน้าที่','สถาบันพัฒนาการเด็กราชนครินทร์','','','','','user','42','','','','','2020-09-11 09:09:02','1'],
            [55,'a9a177846d4f00937bb6c0d705153630','secret43','7eccbc095667b7f0dbd24a225eaead65','เจ้าหน้าที่','สถาบันเด็กและวัยรุ่นภาคตะวันออกเฉียงเหนือ','','','','','user','43','','','','','2020-09-11 09:09:02','1'],
            [56,'53d921a19732d28860c3d3229863f63d','secret44','0830f2057358fd89cd2cb9deb02c3b45','เจ้าหน้าที่','สถาบันสุขภาพจิตเด็กและวัยรุ่นภาคใต้','','','','','user','44','','','','','2020-09-11 09:09:02','1'],
            [57,'7dcf023712c84989acdba676643bdbfc','secret45','ade3ad7abf783ce1672062f7c3b06047','เจ้าหน้าที่','ศูนย์สุขภาพจิตที่ 13','','','','','user','45','','','','','2020-09-11 09:09:02','1'],
            [58,'942570b69d36b79032e4c147f1ad0491','secret46','d2de613540411a61c79d7ee1d2e70afa','เจ้าหน้าที่','สำนักวิชาการสุขภาพจิต','','','','','user','46','','','','','2020-09-11 09:09:02','1'],
            [59,'d63718f84721146d6db4c69ec2927dd8','secret47','585e561b534b5e1c32e262059e709fa1','เจ้าหน้าที่','สำนักเทคโนโลยีสารสนเทศ','','','','','user','47','','','','','2020-09-11 09:09:02','1'],
            [60,'d1e680ab31733dba3f726fac5eec719d','secret48','01e79cb16170d5fae1e66645bf74e91a','เจ้าหน้าที่','สำนักงานวิเทศสัมพันธ์','','','','','user','48','','','','','2020-09-11 09:09:02','0'],
            [61,'7ef9858ba4c55178440d18ba55c395c4','secret00','7554cf9a12878908b02f90799eb27ccf','เจ้าหน้าที่ ','กรมสุขภาพจิต','086-034-9565','02-149-5512','amonwanr@gmail.com','','user','49','','','','','2023-01-03 11:08:53','1'],
            [62,'6b0d0e394fcb3d22a90b5637d533eb0f','secret49','0d4419e0fdb5f1b999a0c16758e89e4f','เจ้าหน้าที่ ','ลคสช','080-','02-','amon@gmail.com','','user','50','','','','','2023-02-17 12:00:34','1'],
            [63,'080d7e24e19fc0f8c0c2614d44ffe64f','secret50','9a8a929cfd9ff5d23c947dd9ad2cada1','เจ้าหน้าที่','สำนักความรอบรู้สุขภาพจิต','0','0','0@gmail','','user','51','','','','','2024-04-18 14:36:32','1']

        ];

        foreach($items2 as $item){
            $chk = User::where('id',$item[0])->first();
            if(empty($chk)){
                User::create([
                    'id' => $item[0],
                    'username' => $item[2],
                    'password' => Hash::make(1234),
                    'name' => $item[4].' '.$item[5],
                    'level' => 'unit',
                    'unit_id' => $item[11],
                ]);
                echo "User ".$item[1]." create successfull."."\n";
            }else{
                $chk->update([
                    'username' => $item[2],
                    'name' => $item[4].' '.$item[5],
                    'unit_id' => $item[11],
                ]);
                echo "User ".$item[1]." updated successfull."."\n";
            }
        }*/

    }
}


