@extends('layouts.app')

@section('pageTitle', 'ระบบบริหารจัดการข้อคิดเห็นข้อร้องเรียน กรมสุขภาพจิต')

@section('content')
<div class="container mx-auto py-11">

   <div class="row" style="font-size: 15px; background-color: white;">
        <div class="col-12" style="font-size: 15px;">
<h5 style="font-size: 20px;">นโยบายคุกกี้</h5>
<p style="font-size: 15px;">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; เมื่อท่านได้เข้าสู่เว็บไซต์ (<a href="https://dmh.go.th/" style="font-size: 15px;">https://dmh.go.th/</a>) ข้อมูลที่เกี่ยวข้องกับการเข้าสู่เว็บไซต์ของ ท่านจะถูกบันทึกไว้ในรูปแบบของคุกกี้ โดยนโยบายคุกกี้นี้จะอธิบายถึงความหมาย การทำงาน วัตถุประสงค์ รวมถึงการลบและการปฏิเสธการเก็บคุกกี้เพื่อความเป็นส่วนตัวของท่าน โดยการเข้าสู่เว็บไซต์นี้ถือว่าท่านได้ อนุญาตให้เราใช้คุกกี้ตามนโยบายคุกกี้ที่มีรายละเอียดดังต่อไปนี้</p>
<br>
<h5 style="font-size: 20px;">คุกกี้คืออะไร</h5>
<p style="font-size: 15px;">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; คุกกี้ คือ ไฟล์ขนาดเล็กที่ถูกสร้างขึ้นเพื่อจัดเก็บข้อมูลการเข้าใช้งานเว็บไซต์เช่น วันเวลา ลิงค์ที่คลิก หน้าที่เข้าชม เงื่อนไขการตั้งค่าต่าง ๆ โดยจะบันทึกลงไปในอุปกรณ์คอมพิวเตอร์ และ/หรือ เครื่องมือสื่อสารที่ เข้าใช้งานของท่าน เช่น Laptop Tablet หรือ Smartphone ผ่านทางเว็บเบราว์เซอร์ในขณะที่ท่านเข้าสู่ เว็บไซต์ โดยคุกกี้จะไม่ก่อให้เกิดอันตรายต่ออุปกรณ์คอมพิวเตอร์ และ/หรือ เครื่องมือสื่อสารของท่าน ในกรณี ดังต่อไปนี้ ข้อมูลส่วนบุคคลของท่านอาจถูกจัดเก็บเพื่อใช้เพิ่มประสบการณ์การใช้งานบริการทางออนไลน์ โดย จะจำเอกลักษณ์ของภาษาและปรับแต่งข้อมูลการใช้งานตามความต้องการของท่าน เป็นการยืนยันคุณลักษณะ เฉพาะตัว ข้อมูลความปลอดภัยของท่าน รวมถึงบริการที่ท่านสนใจ นอกจากนี้คุกกี้ยังถูกใช้เพื่อวัดปริมาณการ เข้าใช้งานบริการทางออนไลน์การปรับเปลี่ยนเนื้อหาตามการใช้งานของท่านโดยพิจารณาจากพฤติกรรมการ เข้าใช้งานครั้งก่อนหน้าและ ณ ปัจจุบัน และอาจมีวัตถุประสงค์เพื่อการโฆษณาประชาสัมพันธ์ทั้งนี้ท่าน สามารถค้นหาข้อมูลเพิ่มเติมเกี่ยวกับคุกกี้ได้ที่ <a href="https://www.allaboutcookies.org/" target="_blank" rel="noopener" style="font-size: 15px;">www.allaboutcookies.org</a></p>
<br>
<h5 style="font-size: 20px;">กรมสุขภาพจิต ใช้คุกกี้อย่างไร</h5>
<p style="font-size: 15px;">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; กรมสุขภาพจิต ใช้คุกกี้ เพื่อบันทึกการเข้าเยี่ยมชมเว็บไซต์ของท่าน และนำไปปรับปรุงเว็บไซต์ให้ตรงกับ ความต้องการของท่านมากยิ่งขึ้น อีกทั้งเพื่ออำนวยความสะดวกให้เกิดความรวดเร็วในการใช้งานเว็บไซต์ของ ท่าน และในบางกรณี กรมสุขภาพจิต จำเป็นต้องให้บุคคลที่สามช่วยดำเนินการดังกล่าว ซึ่งอาจจะต้องใช้ อินเทอร์เน็ต โปรโตคอลแอดเดรส (IP Address) และคุกกี้เพื่อวิเคราะห์ทางสถิติ ตลอดจนเชื่อมโยงข้อมูล และประมวลผล ตามวัตถุประสงค์ทางการตลาด</p>
<br>
<p style="font-size: 15px;">คุกกี้ที่ กรมสุขภาพจิต ใช้ อาจจะแบ่งได้ 2 ประเภทตามการจัดเก็บ ดังนี้</p>
<ol style="font-size: 15px;">
<li style="font-size: 15px;">Session Cookies เป็นคุกกี้ที่จะอยู่ชั่วคราวเพื่อจดจำท่านในระหว่างที่ท่านเข้าเยี่ยมชม เว็บไซต์ของ กรมสุขภาพจิต เช่น เฝ้าติดตามภาษาที่ท่านได้ตั้งค่าและเลือกใช้ เป็นต้น และจะมีการ ลบออกจากเครื่องคอมพิวเตอร์หรืออุปกรณ์ของท่าน เมื่อท่านออกจากเว็บไซต์หรือได้ทำการ ปิดเว็บเบราว์เซอร์</li>
<li style="font-size: 15px;">Persistent Cookie เป็นคุกกี้ที่จะอยู่ตามระยะเวลาที่กำหนดหรือจนกว่าท่านจะลบออก คุกกี้ประเภทนี้จะช่วยให้เว็บไซต์ของ กรมสุขภาพจิต จดจำท่านและการตั้งค่าต่าง ๆ ของท่านเมื่อ ท่านกลับมาใช้บริการเว็บไซต์อีกครั้ง ซึ่งจะช่วยให้ท่านเข้าใช้บริการเว็บไซต์ได้สะดวกรวดเร็ว ยิ่งขึ้น</li>
</ol>
<br>
<p style="font-size: 15px;">วัตถุประสงค์ในการใช้งานคุกกี้ที่ กรมสุขภาพจิต ใช้มีรายละเอียดดังนี้</p>
<ul style="font-size: 15px;">
<li style="font-size: 15px;">คุกกี้ที่มีความจำเป็น (Strictly Necessary Cookies) คุกกี้ประเภทนี้มีความจำเป็นต่อการให้บริการเว็บไซต์ของ กรมสุขภาพจิต เพื่อให้ท่านสามารถเข้าใช้งานในส่วน ต่าง ๆ ของเว็บไซต์ได้ รวมถึงช่วยจดจำข้อมูลที่ท่านเคยให้ไว้ผ่านเว็บไซต์ การปิดการใช้งานคุกกี้ประเภท นี้จะส่งผลให้ท่านไม่สามารถใช้บริการในสาระสำคัญของ กรมสุขภาพจิต ซึ่งจำเป็นต้องเรียกใช้คุกกี้ได้</li>
<li style="font-size: 15px;">คุกกี้เพื่อการวิเคราะห์และประเมินผลการใช้งาน (Performance/Statistics Cookies) คุกกี้ประเภทนี้ช่วยให้ กรมสุขภาพจิต ทราบถึงการปฏิสัมพันธ์ของผู้ใช้งานในการใช้บริการเว็บไซต์ของ กรมสุขภาพจิต รวมถึงหน้าเพจหรือพื้นที่ใดของเว็บไซต์ที่ได้รับความนิยม ตลอดจนการวิเคราะห์ข้อมูลด้าน อื่น ๆ กรมสุขภาพจิต ยังใช้ข้อมูลนี้เพื่อการปรับปรุงการทำงานของเว็บไซต์ และเพื่อเข้าใจพฤติกรรมของ ผู้ใช้งานมากขึ้น ถึงแม้ว่า ข้อมูลที่คุกกี้นี้เก็บรวบรวมจะเป็นข้อมูลที่ไม่สามารถระบุตัวตนได้ และ นำมาใช้วิเคราะห์ทางสถิติเท่านั้น การปิดการใช้งานคุกกี้ประเภทนี้จะส่งผลให้ กรมสุขภาพจิต ไม่สามารถ ทราบปริมาณผู้เข้าเยี่ยมชมเว็บไซต์ และไม่สามารถประเมินคุณภาพการให้บริการได</li>
</ul>
<br>
<table class="table table-bordered">
<thead>
<tr>
<th>ประเภทของคุกกี้</th>
<th>รายละเอียด</th>
<th>รายการคุกกี้</th>
</tr>
</thead>
<tbody>
<tr>
<td>คุกกี้ที่มีความจำเป็น (Strictly Necessary Cookies)</td>
<td>คุกกี้ประเภทนี้มีความจำเป็นต่อการให้บริการ เว็บไซต์ของ กรมสุขภาพจิต เพื่อให้ท่านสามารถเข้า ใช้งานในส่วนต่าง ๆ ของเว็บไซต์ได้ รวมถึง ช่วยจดจำข้อมูลที่ท่านเคยให้ไว้ผ่านเว็บไซต์ การปิดการใช้งานคุกกี้ประเภทนี้จะส่งผลให้ ท่านไม่สามารถใช้บริการในสาระสำคัญของ กรมสุขภาพจิต ซึ่งจำเป็นต้องเรียกใช้คุกกี้ได้</td>
<td>
<ul class="table" style="font-size: 16px;">
<li style="font-size: 16px;">ASPSESSIONIDCQVCQACD</li>
<li style="font-size: 16px;">cookiesession1</li>
</ul>
</td>
</tr>
<tr>
<td>คุกกี้เพื่อการวิเคราะห์และ ประเมินผลการใช้งาน (Performance/Statistics Cookies)</td>
<td>คุกกี้ประเภทนี้ช่วยให้ กรมสุขภาพจิต ทราบถึงการ ปฏิสัมพันธ์ของผู้ใช้งานในการใช้บริการ เว็บไซต์ของ กรมสุขภาพจิต รวมถึงหน้าเพจหรือ พื้นที่ใดของเว็บไซต์ที่ได้รับความนิยม ตลอดจนการวิเคราะห์ข้อมูลด้านอื่น ๆ กรมสุขภาพจิต ยังใช้ข้อมูลนี้เพื่อการปรับปรุงการ ทำงานของเว็บไซต์ และเพื่อเข้าใจพฤติกรรม ของผู้ใช้งานมากขึ้น ถึงแม้ว่า ข้อมูลที่คุกกี้นี้ เก็บรวบรวมจะเป็นข้อมูลที่ไม่สามารถระบุ ตัวตนได้ และนำมาใช้วิเคราะห์ทางสถิติ เท่านั้น การปิดการใช้งานคุกกี้ประเภทนี้จะ ส่งผลให้กรมสุขภาพจิต ไม่สามารถทราบปริมาณผู้ เข้าเยี่ยมชมเว็บไซต์ และไม่สามารถประเมิน คุณภาพการให้บริการได้&nbsp;</td>
<td>
<ul style="font-size: 16px;">
<li style="font-size: 16px;">_ga</li>
<li style="font-size: 16px;">_gid</li>
<li style="font-size: 16px;">_gat</li>
</ul>
</td>
</tr>
</tbody>
</table>
<br><br>
<h5 style="font-size: 20px;">ท่านสามารถจัดการคุกกี้ได้อย่างไร</h5>
<p style="font-size: 15px;">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; บราวเซอร์ส่วนใหญ่จะมีการตั้งค่าให้มีการยอมรับคุกกี้เป็นค่าเริ่มต้น อย่างไรก็ตาม ท่านสามารถ ปฏิเสธการใช้งานหรือลบคุกกี้ในหน้าการตั้งค่าของบราวเซอร์ที่ท่านใช้งานอยู่ ทั้งนี้ หากท่านทำการปรับเปลี่ยน การตั้งค่าบราวเซอร์ของท่านอาจส่งผลกระทบต่อรูปแบบและการใช้งานบนหน้าเว็บไซต์รวมถึงอาจไม่สามารถ ใช้บริการเว็บไซต์ได้ตามปกติหากท่านประสงค์ที่จะทำการปรับเปลี่ยนการตั้งค่า ท่านสามารถตรวจสอบ รายละเอียดเพิ่มเติมได้จากขั้นตอนการดำเนินการของผู้ให้บริการ เช่น</p>
<br>- Android (Chrome) https://support.google.com/chrome/answer/95647?co=GENIE.Platform%3DAndroid&amp;hl=en&amp;o co=1 <br><br>- Apple Safari https://support.apple.com/en-gb/guide/safari/sfri11471/mac <br><br>- Blackberry https://docs.blackberry.com/content/dam/docs-blackberry-com/release-pdfs/en/device-userguides/BlackBerry-Classic-Smartphone-10.3.3-User-Guide-en.pdf <br><br>- Google Chrome https://support.google.com/chrome/answer/95647?co=GENIE.Platform%3DDesktop&amp;hl=en <br><br>- Microsoft Edge https://support.microsoft.com/en-us/windows/microsoft-edge-browsing-data-and-privacybb8174ba-9d73-dcf2-9b4a-c582b4e640dd <br><br>- Microsoft Internet Explorer https://support.microsoft.com/en-us/topic/delete-and-manage-cookies-168dab11-0753-043d7c16-ede5947fc64d <br><br>- Mozilla Firefox https://support.mozilla.org/en-US/kb/enhanced-tracking-protection-firefoxdesktop?redirectslug=enable-and-disable-cookies-website-preferences&amp;redirectlocale=en-US <br><br>- Opera https://help.opera.com/en/latest/web-preferences/ <br><br>- Iphone or Ipad (Chrome) https://support.google.com/chrome/answer/95647?co=GENIE.Platform%3DiOS&amp;hl=en&amp;oco=1 <br><br>- Iphone or Ipad (Safari) https://support.apple.com/en-us/HT201265 <br><br>
<p style="font-size: 15px;">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;กรมสุขภาพจิต จะไม่รับผิดชอบและ กรมสุขภาพจิต ไม่ได้มีความเกี่ยวข้องกับเว็บไซต์ รวมทั้งเนื้อหาใน เว็บไซต์ต่าง ๆ ที่เกี่ยวข้องกับการตั้งค่าคุกกี้ข้างต้น เนื่องจากเป็นข้อมูลจากผู้ให้บริการโดยตรง</p>
<br>
<h5 style="font-size: 20px;">การเชื่อมโยงข้อมูลกับเว็บไซต์อื่น</h5>
<p style="font-size: 15px;">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;เว็บไซต์ของ กรมสุขภาพจิต อาจมีการเชื่อมโยงไปยังเว็บไซต์หรือโซเชียลมีเดียซึ่งเป็นผู้ให้บริการภายนอก รวมถึงอาจมีการฝัง (Embed) เนื้อหาหรือวีดีโอที่มาจากโซเชียลมีเดีย เช่น YouTube Facebook หรือ เว็บไซต์สำนักงาน กสทช. เป็นต้น ซึ่งจะช่วยให้ท่านเข้าถึงเนื้อหาและสร้างการปฏิสัมพันธ์กับบุคคล/หน่วยงาน อื่นบนโซเชียลมีเดียผ่านเว็บไซต์ของ กรมสุขภาพจิต ได้ ซึ่งเว็บไซต์หรือโซเชียลมีเดียดังกล่าวจะมีการกำหนดและตั้งค่า คุกกี้ขึ้นมาเอง โดยที่ กรมสุขภาพจิต ไม่สามารถควบคุมหรือรับผิดชอบต่อคุกกี้เหล่านั้นได้ และขอแนะนำให้ท่าน ควรกษานโยบายหรือประกาศการใช้คุกกี้ของผู้ให้บริการดังกล่าวด้วย</p>
<br>
<h5 style="font-size: 20px;">การเปลี่ยนแปลงประกาศ</h5>
<p style="font-size: 15px;">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; ประกาศนี้อาจมีการปรับปรุงให้เหมาะสมและสอดคล้องกับสถานการณ์และตามการให้บริการจริง โดย กรมสุขภาพจิต จะมีการแจ้งประกาศที่มีการปรับปรุงใหม่บนเว็บไซต์นี้ ดังนั้น กรมสุขภาพจิต ขอแนะนำให้ท่าน ตรวจสอบให้แน่ใจว่าท่านได้เข้าใจการเปลี่ยนแปลงตามข้อกำหนดดังกล่าว</p>
<br>
<h5 style="font-size: 20px;">ติดต่อ กรมสุขภาพจิต</h5>
<p style="font-size: 15px;">ในกรณีที่ท่านมีคำถามเกี่ยวกับนโยบายคุกกี้ของเรา ท่านสามารถติดต่อสอบถามได้ที่</p>
<h5 style="font-size: 20px;">สำนักเทคโนโลยีสารสนเทศ กรมสุขภาพจิต</h5>
<p style="padding-left: 0px; font-size: 15px;">- สถานที่ติดต่อ: เลขที่ 88/20 หมู่ 4 ถนนติวานนท์ อำเภอเมือง จังหวัดนนทบุรี 11000
 <br>- ช่องทางการติดต่อ: โทร 02 149 5555 ถึง 60 อีเมล ict@dmh.mail.go.th</p>
        </div>
    </div>


</div>
@endsection