@extends('layouts.app')

@section('pageTitle', 'ระบบบริหารจัดการข้อคิดเห็นข้อร้องเรียน กรมสุขภาพจิต')

@section('content')
<div class="container mx-auto py-11">
  <p class="text-center font22">นโยบายการคุ้มครองข้อมูลส่วนบุคคลของกลุ่มตรวจสอบภายใน กรมสุขภาพจิต</p>
<p class="text-center font22">Privacy Policy of   of Department of Mental Health, Ministry of Public Health</p>
<p class="text-center font22">จัดทำเมื่อวันที่ 1 มิถุนายน 2556</p>

<h2>1. วัตถุประสงค์</h2>
<p class="text-content1">กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ได้จัดทำนโยบายการคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ขึ้น เพื่อคุ้มครองข้อมูลส่วนบุคคลของผู้ใช้บริการทุกท่าน (Personal Information) ที่ติดต่อเข้ามายังเว็บไซต์ของกลุ่มตรวจสอบภายใน กรมสุขภาพจิต ดังนี้
</p>
<p class="text-content"></p>
<h2>การเก็บรวบรวมข้อมูลส่วนบุคคล</h2>
<p class="text-content1">1. เพื่อความสะดวกในการให้บริการแก่ผู้ใช้บริการทุกท่านที่เข้ามาใช้บริการเว็บไซต์ของกลุ่มตรวจสอบภายใน กรมสุขภาพจิต ทางเว็บไซต์จึงได้จัดเก็บรวบรวมข้อมูลส่วนบุคคลของท่านไว้ เช่น อีเมล์แอดเดรส (Email Address) ชื่อ (Name) ที่อยู่หรือที่ทำงาน (Home or Work Address) เขตไปรษณีย์ (ZIP Code) หรือหมายเลขโทรศัพท์ (Telephone Number) เป็นต้น</p>
<p class="text-content1">2. ในกรณีที่ท่านสมัคร (Sign Up) เพื่อสมัครสมาชิกหรือเพื่อใช้บริการอย่างใดอย่างหนึ่ง กลุ่มตรวจสอบภายใน กรมสุขภาพจิต จะเก็บรวบรวมข้อมูลส่วนบุคคลของท่านเพิ่มเติม ได้แก่ เพศ (Sex) อายุ (Gender) สิ่งที่โปรดปราน/ความชอบ (Preferences/Favorites) ความสนใจ (Interests) หรือหมายเลขบัตรเครดิต (CreditCard Number) และที่อยู่ในการแจ้งค่าใช้จ่าย (Billing Address)</p>
<p class="text-content1">3. นอกจากนั้น เพื่อสำรวจความนิยมในการใช้บริการ อันจะเป็นประโยชน์ในการนำสถิติไปใช้ในการปรับปรุงคุณภาพในการให้บริการของกลุ่มตรวจสอบภายใน กรมสุขภาพจิต จึงจำเป็นต้องจัดเก็บรวบรวมข้อมูลของท่านบางอย่างเพิ่มเติม ได้แก่ หมายเลขไอพี (IP Address) ชนิดของโปรแกรม ค้นผ่าน (Browser Type) โดเมนเนม (Domain Name) บันทึกหน้าเว็บ (web page) ของเว็บไซต์ที่ผู้ใช้เยี่ยมชม เวลาที่เยี่ยมชมเว็บไซต์ (Access Times) และเว็บไซต์ที่ผู้ใช้บริการเข้าถึงก่อนหน้านั้น (Referring Website Addresses)</p>
<p class="text-content1">4. กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ขอแนะนำให้ท่านตรวจสอบนโยบายการคุ้มครองข้อมูลส่วนบุคคล (PrivacyPolicy) ของเว็บไซต์อื่นที่เชื่อมโยงจากเว็บไซต์นี้ เพื่อจะได้ทราบและเข้าใจว่าเว็บไซต์ดังกล่าวเก็บรวบรวม ใช้ หรือดำเนินการเกี่ยวกับข้อมูลส่วนบุคคลของท่านอย่างไร ทั้งนี้ กลุ่มตรวจสอบภายใน กรมสุขภาพจิตไม่สามารถรับรอง ข้อความ หรือรับรองการดำเนินการใดๆ ตามที่ได้มีการประกาศไว้ในเว็บไซต์ดังกล่าวได้ และไม่ขอรับผิดชอบใดๆ หากเว็บไซต์เหล่านั้นไม่ได้ปฏิบัติการหรือดำเนินการใดๆ ตามนโยบายการคุ้มครองข้อมูลส่วนบุคคลที่ เว็บไซต์ดังกล่าวได้ประกาศไว้</p>
<p class="text-content"></p>
<h2>การใช้ข้อมูลส่วนบุคคล</h2>
<p class="text-content1">1. กลุ่มตรวจสอบภายใน กรมสุขภาพจิต จะใช้ข้อมูลส่วนบุคคลของท่านเพียงเท่าที่จำเป็น เช่น ชื่อ และ ที่อยู่ เพื่อใช้ในการติดต่อ ให้บริการประชาสัมพันธ์ หรือให้ข้อมูลข่าวสารต่างๆ รวมทั้งสำรวจความคิดเห็นของท่านในกิจการหรือกิจกรรมของ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต เท่านั้น </p>
<p class="text-content1">2. กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ขอรับรองว่าจะไม่นำข้อมูลส่วนบุคคลของท่านที่ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ได้เก็บรวบรวมไว้ ไปขายหรือเผยแพร่ให้กับบุคคลภายนอกโดยเด็ดขาด เว้นแต่จะได้รับอนุญาตจากท่านเท่านั้น </p>
<p class="text-content1">3. ในกรณีที่ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ได้ว่าจ้างหน่วยงานอื่นเพื่อให้ดำเนินการเกี่ยวกับข้อมูลส่วนบุคคลของท่าน เช่น การจัดส่งพัสดุไปรษณีย์ การวิเคราะห์เชิงสถิติในกิจการหรือกิจกรรมของ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต เป็นต้น กลุ่มตรวจสอบภายใน กรมสุขภาพจิต จะกำหนดให้หน่วยงานที่ได้ว่าจ้างให้ดำเนินการดังกล่าว เก็บรักษาความลับ และความปลอดภัยของข้อมูลส่วนบุคคลของท่าน และกำหนดข้อห้ามมิให้มีการนำข้อมูลส่วนบุคคลดังกล่าว ไปใช้นอกเหนือจากกิจกรรมหรือกิจการของ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต </p>
<p class="text-content"></p>
<h2>สิทธิในการควบคุมข้อมูลส่วนบุคคลของท่าน</h2>
<p class="text-content1">เพื่อประโยชน์ในการรักษาความเป็นส่วนตัวของท่านๆ มีสิทธิเลือกที่จะให้มีการใช้หรือแชร์ข้อมูลส่วนบุคคลของท่าน หรืออาจเลือกที่จะไม่รับข้อมูลหรือสื่อทางการตลาดใดๆ จาก กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ก็ได้ โดยเพียงแต่ท่านกรอกความจำนงดังกล่าวเพื่อแจ้งให้ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ทราบในหน้าเว็บ http://www.dmh.go.th</p>
<p class="text-content"></p>
<h2>การรักษาความปลอดภัยสำหรับข้อมูลส่วนบุคคล</h2>
<p class="text-content1">เพื่อประโยชน์ในการรักษาความลับและความปลอดภัยสำหรับข้อมูลส่วนบุคคลของท่าน กลุ่มตรวจสอบภายใน กรมสุขภาพจิต จึงได้กำหนดระเบียบภายในหน่วยงานเพื่อกำหนดสิทธิในการเข้าถึงหรือใช้ข้อมูลส่วนบุคคลของท่าน และเพื่อรักษาความลับและความปลอดภัยของข้อมูลบางอย่างที่มีความสำคัญอย่างยิ่ง เช่น หมายเลขบัตรเครดิต เป็นต้น กลุ่มตรวจสอบภายใน กรมสุขภาพจิต จึงได้จัดให้มีช่องทางการสื่อสารแบบปลอดภัยสำหรับข้อมูลดังกล่าวด้วยการเข้ารหัสลับข้อมูลดังกล่าว เช่น จัดให้มีการใช้ Secure Socket Layer (SSL) protocol เป็นต้น</p>
<p class="text-content"></p>
<h2>การใช้คุกกี้ (Cookies)</h2>
<p class="text-content1">“คุกกี้” คือ ข้อมูลที่ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ส่งไปยังโปรแกรมค้นผ่านเว็บไซต์ (Web browser) ของผู้ใช้บริการ และเมื่อมีการติดตั้งข้อมูลดังกล่าวไว้ในระบบของท่านแล้ว หากมีการใช้ “คุกกี้” ก็จะทำให้เว็บไซต์ http://www.moph.go.th สามารถบันทึกหรือจดจำข้อมูลของผู้ใช้บริการไว้ จนกว่าผู้ใช้บริการจะออกจากโปรแกรมค้นผ่านเว็บไซต์ หรือจนกว่าผู้ใช้บริการจะทำการลบ “คุกกี้” นั้นเสีย หรือไม่อนุญาตให้ “คุกกี้” นั้น ทำงานอีกต่อไป </p>
<p class="text-content1">หากท่านเลือกใช้ “คุกกี้” แล้ว ท่านจะได้รับความสะดวกสบายในการท่องเว็บไซต์มากขึ้น เพราะ “คุกกี้” จะช่วยจดจำเว็บไซต์ที่ท่านแวะหรือเยี่ยมชม ทั้งนี้ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต จะนำข้อมูลที่ “คุกกี้” ได้บันทึกหรือเก็บรวบรวมไว้ ไปใช้ในการวิเคราะห์เชิงสถิติ หรือในกิจกรรมอื่นของ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต เพื่อ ปรับปรุงคุณภาพการให้บริการของ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ต่อไป</p>
<p class="text-content"></p>
<h2>การปรับปรุงนโยบายการคุ้มครองข้อมูลส่วนบุคคล</h2>
<p class="text-content1">กลุ่มตรวจสอบภายใน กรมสุขภาพจิต อาจทำการปรับปรุงหรือแก้ไขนโยบายการคุ้มครองข้อมูลส่วนบุคคลโดยมิได้แจ้งให้ท่านทราบล่วงหน้า ทั้งนี้ เพื่อความเหมาะสมและมีประสิทธิภาพในการให้บริการ ดังนั้น กลุ่มตรวจสอบภายใน กรมสุขภาพจิต จึงขอแนะนำให้ผู้ใช้บริการอ่านนโยบายการคุ้มครองข้อมูลส่วนบุคคลทุกครั้งที่เยี่ยมชม หรือมีการใช้บริการจากเว็บไซต์ของกลุ่มตรวจสอบภายใน กรมสุขภาพจิต</p>
<p class="text-content"></p>
<h2>การปฏิบัติตามนโยบายคุ้มครองข้อมูลส่วนบุคคลและการติดต่อกับ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต</h2>
<p class="text-content1">ในกรณีที่ท่านมีข้อสงสัย ข้อเสนอแนะ หรือข้อติชมใดๆ เกี่ยวกับนโยบายการคุ้มครองข้อมูลส่วนบุคคล หรือการปฏิบัติตามนโยบายการคุ้มครองข้อมูลส่วนบุคคลฉบับนี้ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ยินดีที่จะตอบข้อสงสัย รับฟังข้อเสนอแนะ และคำติชมทั้งหลาย อันจะเป็นประโยชน์ต่อการปรับปรุงการให้บริการของกลุ่มตรวจสอบภายใน กรมสุขภาพจิตต่อไป โดยท่านสามารถติดต่อกับ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ตามที่อยู่ที่ปรากฏข้างล่างนี้</p>

<p class="text-content"></p>
<p class="text-content"></p>
<p class="text-content2">กลุ่มตรวจสอบภายใน กรมสุขภาพจิต </p>
<p class="text-content2">ถนนติวานนท์ ต.ตลาดขวัญ อ.เมือง จ.นนทบุรี 11000 </p>
 <p class="text-content2">Email - auditdmh@gmail.com, audit_8447@yahoo.co.th</p>


</div>
@endsection