@extends('layouts.app')

@section('pageTitle', 'ระบบบริหารจัดการข้อคิดเห็นข้อร้องเรียน กรมสุขภาพจิต')

@section('content')
<div class="container mx-auto py-11">
  <p class="text-center font22">นโยบายการรักษาความมั่นคงปลอดภัยเว็บไซต์ของกลุ่มตรวจสอบภายใน กรมสุขภาพจิต</p>
<p class="text-center font22">Website Security Policy of Department of Mental Health, Ministry of Public Health</p>
<p class="text-center font22">จัดทำเมื่อวันที่ 1 มิถุนายน 2556</p>

<h2>มาตรการ และวิธีการรักษาความมั่นคงปลอดภัยเว็บไซต์</h2>
<p class="text-content1">กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ได้ตระหนักถึงความสำคัญในการรักษาความมั่นคงปลอดภัยเว็บไซต์ เพื่อปกป้องข้อมูลของผู้ใช้บริการจากการถูกทำลาย หรือบุกรุกจากผู้ไม่หวังดี หรือผู้ที่ไม่มีสิทธิ์ในการเข้าถึงข้อมูล จึงได้กำหนดมาตรการรักษาความมั่นคงปลอดภัยเว็บไซต์ โดยใช้มาตรฐานการรักษาความปลอดภัยของข้อมูลขั้นสูง ด้วยเทคโนโลยี Secured Socket Layer (SSL) ซึ่งเป็นเทคโนโลยีในการเข้าสู่ข้อมูลผ่านรหัสที่ระดับ 128 bits (128-bits Encryption) เพื่อเข้ารหัสข้อมูลที่ถูกส่งผ่านเครือข่ายอินเทอร์เน็ตในทุกครั้ง ที่มีการทำธุรกรรมทางการเงินผ่านเครือข่ายอินเทอร์เน็ตของ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ทำให้ผู้ที่ดักจับข้อมูลระหว่างทางไม่สามารถนำข้อมูลไปใช้ต่อได้ โดยจะใช้การเข้ารหัสเป็นหลักในการรักษาความปลอดภัยของข้อมูล โดยผู้ใช้บริการสามารถสังเกตได้จากชื่อโปรโตคอลที่เป็น https://</p>
<p class="text-content"></p>
<h2>เทคโนโลยีเสริมที่นำมาใช้ในการรักษาความมั่นคงปลอดภัย</h2>
<p class="text-content1">นอกจากมาตรการ และวิธีการรักษาความมั่นคงปลอดภัยโดยทั่วไปที่กล่าวข้างต้นแล้ว กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ยังใช้เทคโนโลยีระดับสูงดังต่อไปนี้เพื่อปกป้องข้อมูลส่วนตัวของท่าน </p>
<p class="text-content1">&nbsp;&nbsp;&nbsp;&nbsp;– Firewall เป็นระบบซอฟท์แวร์ที่จะอนุญาตให้เฉพาะผู้ที่มีสิทธิ หรือผู้ที่กลุ่มตรวจสอบภายใน กรมสุขภาพจิต อนุมัติเท่านั้นจึงจะผ่าน Fire Wall เพื่อเข้าถึงข้อมูลได้</p>
<p class="text-content1">&nbsp;&nbsp;&nbsp;&nbsp;– Scan Virus นอกจากเครื่องคอมพิวเตอร์ทุกเครื่องที่ให้บริการจะมีการติดตั้ง Software ป้องกัน Virus ที่มีประสิทธิภาพสูงและ Update อย่างสม่ำเสมอแล้ว กลุ่มตรวจสอบภายใน กรมสุขภาพจิตยังได้ติดตั้ง Scan Virus Software บนเครื่อง Server โดยเฉพาะอีกด้วย</p>
<p class="text-content1">&nbsp;&nbsp;&nbsp;&nbsp;– Cookies เป็นไฟล์คอมพิวเตอร์เล็กๆ ที่จะทำการเก็บข้อมูลชั่วคราวที่จำเป็น ลงในเครื่องคอมพิวเตอร์ของผู้ขอใช้บริการ เพื่อความสะดวกและรวดเร็วใน การติดต่อสื่อสาร อย่างไรก็ตาม กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ตระหนักถึงความเป็นส่วนตัวของ ผู้ใช้บริการเป็นอย่างดี จึงหลีกเลี่ยงการใช้ Cookies แต่ถ้าหากมีความจำเป็น ต้องใช้ Cookies กลุ่มตรวจสอบภายใน กรมสุขภาพจิตจะพิจารณาอย่างรอบคอบ และตระหนักถึงความปลอดภัย และความเป็นส่วนตัวของผู้ขอรับบริการเป็นหลัก </p>
<p class="text-content1">&nbsp;&nbsp;&nbsp;&nbsp;– Auto Log off ในการใช้บริการของกลุ่มตรวจสอบภายใน กรมสุขภาพจิต หลังจากเลิกการใช้งานควร Log off ทุกครั้ง กรณีที่ผู้ใช้บริการลืม Log off ระบบจะทำการ Log off ให้โดยอัตโนมัติภายในเวลาที่เหมาะสมของแต่ละบริการ ทั้งนี้เพื่อความปลอดภัยของผู้ใช้บริการเอง</p>
<p class="text-content"></p>
<h2>ข้อแนะนำเกี่ยวกับการรักษาความมั่นคงปลอดภัย</h2>
<p class="text-content1">แม้ว่า กลุ่มตรวจสอบภายใน กรมสุขภาพจิต จะมีมาตรฐานเทคโนโลยีและวิธีการทางด้านการรักษาความปลอดภัยอย่างสูง เพื่อช่วยมิให้มีการเข้าสู่ข้อมูลส่วนตัวหรือข้อมูลที่เป็นความลับของท่านโดยปราศจากอำนาจตามที่กล่าว ข้างต้นแล้วก็ตาม แต่ก็เป็นที่ทราบกันอยู่โดยทั่วไปว่า ปัจจุบันนี้ยังมิได้มีระบบ รักษาความปลอดภัยใดๆ ที่จะสามารถปกป้องข้อมูลของท่านได้อย่างเด็ดขาดจากการถูกทำลายหรือถูกเข้าถึงโดยบุคคลที่ปราศจากอำนาจได้ ดังนั้นท่านจึงควรปฏิบัติตามข้อแนะนำเกี่ยวกับการรักษาความมั่นคงปลอดภัยดังต่อไปนี้ด้วยคือ </p>
<p class="text-content1">&nbsp;&nbsp;&nbsp;&nbsp;– ระมัดระวังในการ Download Program จาก Internet มาใช้งาน ควรตรวจสอบ Address ของเว็บไซต์ให้ถูกต้องก่อน Login เข้าใช้บริการเพื่อป้องกันกรณีที่มีการปลอมแปลงเว็บไซต์</p>
<p class="text-content1">&nbsp;&nbsp;&nbsp;&nbsp;– ควรติดตั้งระบบตรวจสอบไวรัสไว้ที่เครื่องและพยายามปรับปรุงให้โปรแกรม ตรวจสอบไวรัสในเครื่องของท่านมีความทันสมัยอยู่เสมอ</p>
<p class="text-content1">&nbsp;&nbsp;&nbsp;&nbsp;– ติดตั้งโปรแกรมประเภท Personal Fire wall เพื่อป้องกันเครื่องคอมพิวเตอร์ จากการจู่โจมของผู้ไม่ประสงค์ดี เช่น Cracker หรือ Hacker</p>

</div>
@endsection