@extends('layouts.app')

@section('pageTitle', 'ระบบบริหารจัดการข้อคิดเห็นข้อร้องเรียน กรมสุขภาพจิต')

@section('content')
<div class="container mx-auto py-11">
  <p class="text-center font22">นโยบายเว็บไซต์ของกลุ่มตรวจสอบภายใน กรมสุขภาพจิต</p>
<p class="text-center font22">Website Policy of Department of Mental Health, Ministry of Public Health</p>
<p class="text-center font22">จัดทำเมื่อวันที่ 1 มิถุนายน 2556</p>


<h2>1. วัตถุประสงค์</h2>
<p class="pl-6">เว็บไซต์กลุ่มตรวจสอบภายใน กรมสุขภาพจิตได้จัดทำขึ้นเพื่อให้บริการ ในการใช้บริการข้อมูลข่าวสารแก่ประชาชนทั่วไป และบุคลากรในสังกัดกรมสุขภาพจิต ในการใช้บริการ
 เว็บไซต์ของผู้ใช้บริการจะอยู่ภายใต้เงื่อนไขและข้อกำหนดดังต่อไปนี้ ผู้ใช้บริการจึงควรศึกษาเงื่อนไข และ ข้อกำหนดการใช้งานเว็บไซต์ และ/หรือเงื่อนไขและข้อตกลงอื่นใดที่ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ได้แจ้งให้ทราบบนเว็บไซต์โดยละเอียดก่อนการเข้าใช้บริการ ทั้งนี้ ในการใช้บริการให้ถือว่าผู้ใช้บริการได้ตกลงที่จะปฏิบัติตาม เงื่อนไขและข้อกำหนดการให้บริการที่กำหนดไว้นี้ หากผู้ใช้บริการไม่ประสงค์ที่จะผูกพันตามข้อกำหนดและเงื่อนไขการให้บริการ ขอความกรุณาท่านยุติการเข้าชมและใช้งานเว็บไซต์นี้ในทันที
</p>
<p class="text-content"></p>
<h2>2. เงื่อนไขและข้อกำหนดการใช้งานเว็บไซต์ </h2>
<p class="pl-6">2.1 ผู้ใช้บริการอาจได้รับ เข้าถึง สร้าง ส่งหรือแสดงข้อมูล เช่น ไฟล์ข้อมูล ข้อความลายลักษณ์ อักษร ซอฟต์แวร์คอมพิวเตอร์ ดนตรี ไฟล์เสียง หรือเสียงอื่นๆ ภาพถ่าย วิดีโอ หรือรูปภาพ อื่นๆ โดยเป็นส่วนหนึ่งของบริการหรือโดยผ่านการใช้บริการ ซึ่งต่อไปนี้จะเรียกว่า “เนื้อหา” </p>
<p class="pl-6">2.2 เนื้อหาที่นำเสนอต่อผู้ใช้บริการ อาจได้รับการคุ้มครองโดยสิทธิในทรัพย์สินทางปัญญาของ เจ้าของเนื้อหานั้น ผู้ใช้บริการไม่มีสิทธิเปลี่ยนแปลงแก้ไข จำหน่ายจ่ายโอนหรือสร้างผลงานต่อเนื่องโดยอาศัยเนื้อหาดังกล่าวไม่ว่าจะทั้งหมดหรือบางส่วน เว้นแต่ผู้ใช้บริการจะได้รับอนุญาตโดยชัดแจ้งจากเจ้าของเนื้อหานั้น </p>
<p class="pl-6">2.3 ผู้ใช้บริการอาจพบเนื้อหาที่ไม่เหมาะสม หรือหยาบคาย อันก่อให้เกิดความไม่พอใจ ภายใต้ความเสี่ยงของตนเอง </p>
<p class="pl-6">2.4 กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ทรงไว้ซึ่งสิทธิในการคัดกรอง ตรวจทาน ทำเครื่องหมาย เปลี่ยนแปลง แก้ไข ปฏิเสธ หรือลบเนื้อหาใดๆ ที่ไม่เหมาะสมออกจากบริการ ซึ่งกลุ่มตรวจสอบภายใน กรมสุขภาพจิต อาจจัดเตรียมเครื่องมือในการคัดกรองเนื้อหาอย่างชัดเจน โดยไม่ขัดต่อกฎหมาย กฎ ระเบียบของทางราชการที่เกี่ยวข้อง </p>
<p class="pl-6">2.5 กลุ่มตรวจสอบภายใน กรมสุขภาพจิต อาจหยุดให้บริการเป็นการชั่วคราวหรือถาวร หรือยกเลิกการให้บริการ แก่ผู้ใช้บริการรายใดเป็นการเฉพาะ หากการให้บริการดังกล่าวส่งผลกระทบต่อผู้ใช้บริการ อื่นๆ หรือขัดแย้งต่อกฎหมาย โดยไม่ต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า </p>
<p class="pl-6">2.6 การหยุดหรือการยกเลิกบริการตามข้อ 2.5 ผู้ใช้บริการจะไม่สามารถเข้าใช้บริการ และ เข้าถึงรายละเอียดบัญชีของผู้ใช้บริการ ไฟล์เอกสารใดๆ หรือเนื้อหาอื่นๆ ที่อยู่ในบัญชีของ ผู้ใช้บริการได้ </p>
<p class="pl-6">2.7 ในกรณีกลุ่มตรวจสอบภายใน กรมสุขภาพจิต หยุดให้บริการเป็นการถาวร หรือยกเลิกบริการแก่ ผู้ใช้บริการ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต มีสิทธิในการลบข้อมูลต่างๆ ที่อยู่ในบัญชีของผู้ใช้บริการได้ โดยไม่ต้องแจ้งให้ผู้ใช้บริการทราบล่วงหน้า</p>

<p class="text-content "></p>
<h2>3. สิทธิ หน้าที่ และความรับผิดชอบของผู้ใช้บริการ</h2> 
<p class="pl-6">3.1 ผู้ใช้บริการจะให้ข้อมูลเกี่ยวกับตนเอง เช่น ข้อมูลระบุตัวตนหรือรายละเอียดการติดต่อ ที่ถูกต้อง เป็นจริง และเป็นปัจจุบันเสมอ แก่กลุ่มตรวจสอบภายใน กรมสุขภาพจิต อันเป็นส่วนหนึ่งของ กระบวนการลงทะเบียนใช้บริการ หรือการใช้บริการที่ต่อเนื่อง</p>
<p class="pl-6">3.2 ผู้ใช้บริการจะใช้บริการเว็บไซต์นี้ เพื่อวัตถุประสงค์ที่ได้รับอนุญาตตามข้อกำหนดของ สำนักยุทธศาสตร์สุขภาพจิตและไม่ขัดต่อกฎหมาย กฎ ระเบียบ ข้อบังคับ หลักปฏิบัติที่เป็นที่ ยอมรับโดยทั่วไป</p>
<p class="pl-6">3.3 ผู้ใช้บริการจะไม่เข้าใช้หรือพยายามเข้าใช้บริการหนึ่งบริการใดโดยวิธีอื่น รวมถึงการใช้ วิธีการอัตโนมัติ (การใช้สคริปต์) นอกจากช่องทางที่ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต จัดเตรียมไว้ให้ เว้นแต่ผู้ใช้บริการจะได้รับอนุญาตจากกลุ่มตรวจสอบภายใน กรมสุขภาพจิต โดยชัดแจ้งให้ทำเช่นนั้นได้</p>
<p class="pl-6">3.4 ผู้ใช้บริการจะไม่ทำหรือมีส่วนร่วมในการขัดขวางหรือรบกวนบริการของกลุ่มตรวจสอบภายใน กรมสุขภาพจิต รวมทั้งเครื่องแม่ข่ายและเครือข่ายที่เชื่อมต่อกับบริการ</p>
<p class="pl-6">3.5 ผู้ใช้บริการจะไม่ทำสำเนา คัดลอก ทำซ้ำ ขาย แลกเปลี่ยน หรือขายต่อบริการเพื่อวัตถุประสงค์ใดๆ เว้นแต่ผู้ใช้บริการจะได้รับอนุญาตจากกลุ่มตรวจสอบภายใน กรมสุขภาพจิต โดยชัดแจ้งให้ทำเช่นนั้นได้</p>
<p class="pl-6">3.6 ผู้ใช้บริการมีหน้าที่ในการรักษาความลับของรหัสผ่านที่เชื่อมโยงกับบัญชีใดๆ ที่ใช้ในการเข้าถึงบริการ</p>
<p class="pl-6">3.7 ผู้ใช้บริการจะเป็นผู้รับผิดชอบแต่เพียงผู้เดียวต่อบุคคลใดๆ รวมถึง กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ในความเสียหายอันเกิดจากการละเมิดข้อกำหนด</p>
<p class="text-content "></p>
<h2>4. การเชื่อมโยงกับเว็บไซต์อื่นๆ</h2>
<p class="pl-6">4.1 การเชื่อมโยงไปยังเว็บไซต์อื่นเป็นเพียงการให้บริการเพื่ออำนวยความสะดวกแก่ผู้ใช้บริการ เท่านั้น กลุ่มตรวจสอบภายใน กรมสุขภาพจิต มิได้มีส่วนเกี่ยวข้องหรือมีอำนาจควบคุม รับรอง ความถูกต้อง ความน่าเชื่อถือ ตลอดจนความรับผิดชอบในเนื้อหาข้อมูลของเว็บไซต์นั้น ๆ และกลุ่มตรวจสอบภายใน กรมสุขภาพจิต ไม่รับผิดชอบต่อเนื้อหาใด ๆ ที่แสดงบนเว็บไซต์อื่นที่เชื่อมโยงมายัง เว็บไซต์ของสำนักยุทธศาสตร์สุขภาพจิตหรือต่อความเสียหายใด ๆ ที่เกิดขึ้นจากการเข้าเยี่ยมชม เว็บไซต์ดังกล่าวการเชื่อมโยงมายังเว็บไซต์สำนักยุทธศาสตร์สุขภาพจิต</p>
<p class="pl-6">4.2 กรณีต้องการเชื่อมโยงมายังเว็บไซต์ของกลุ่มตรวจสอบภายใน กรมสุขภาพจิต ผู้ใช้บริการสามารถเชื่อมโยงมายังหน้าแรกของเว็บไซต์ของสำนักยุทธศาสตร์สุขภาพจิตได้ โดยแจ้งความประสงค์เป็นหนังสือ แต่หากต้องการเชื่อมโยงมายังหน้าภายในของเว็บไซต์นี้ จะต้องได้รับความยินยอมเป็น หนังสือจากสำนักยุทธศาสตร์สุขภาพจิตแล้วเท่านั้น และในการให้ความยินยอมดังกล่าว กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ขอสงวนสิทธิที่จะกำหนดเงื่อนไขใด ๆ ไว้ด้วยก็ได้ ในการที่เว็บไซต์อื่น ที่เชื่อมโยงมายังเว็บไซต์ของ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต จะไม่รับผิดชอบต่อเนื้อหาใด ๆ ที่แสดงบนเว็บไซต์ที่เชื่อมโยงมายังเว็บไซต์ของสำนักยุทธศาสตร์สุขภาพจิตหรือต่อความเสียหายใด ๆ ที่เกิดขึ้นจากการใช้เว็บไซต์เหล่านั้น</p>
<p class="text-content "></p>
<h2>5. การปฏิเสธความรับผิด</h2>
<p class="pl-6">สำนักยุทธศาสตร์สุขภาพจิตจะไม่รับผิดต่อความเสียหายใด ๆ รวมถึง ความเสียหาย สูญเสียและค่าใช้จ่ายที่เกิดขึ้นไม่ว่าโดยตรงหรือโดยอ้อม ที่เป็นผลหรือสืบเนื่องจากการที่ผู้ใช้เข้าใช้เว็บไซต์นี้หรือเว็บไซต์ที่เชื่อมโยงกับเว็บไซต์นี้ หรือต่อความเสียหาย สูญเสียหรือค่าใช้จ่ายที่ เกิดจากความล้มเหลวในการใช้งาน ความผิดพลาด การละเว้น การหยุดชะงัก ข้อบกพร่อง ความไม่สมบูรณ์ คอมพิวเตอร์ไวรัส ถึงแม้ว่า กลุ่มตรวจสอบภายใน กรมสุขภาพจิต จะได้รับแจ้งว่าอาจจะ เกิดความเสียหาย สูญเสียหรือค่าใช้จ่ายดังกล่าวขึ้น นอกจากนี้ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต ไม่รับผิดต่อผู้ใช้เว็บไซต์หรือบุคคลจากการเรียกร้องใด ๆ ที่เกิดขึ้นจากบนเว็บไซต์ หรือเนื้อหาใด ๆ ซึ่งรวมถึงการตัดสินใจหรือการกระทำใด ๆ ที่เกิดจากความเชื่อถือในเนื้อหาดังกล่าวของ ผู้ใช้เว็บไซต์ หรือในความเสียหายใด ๆ ไม่ว่าความเสียหายทางตรง หรือทางอ้อม รวมถึงความเสียหายอื่นใดที่อาจเกิดขึ้นได้ผู้ใช้บริการยอมรับและตระหนักดีว่า สำนักยุทธศาสตร์สุขภาพจิตจะไม่ต้องรับผิดชอบต่อการกระทำใดของผู้ใช้บริการทั้งสิ้น</p>
<p class="text-content "></p>
<h2>6. กรรมสิทธิ์และสิทธิในทรัพย์สินทางปัญญา</h2>
<p class="pl-6">6.1 สำนักยุทธศาสตร์สุขภาพจิตหรือผู้ให้อนุญาตแก่กลุ่มตรวจสอบภายใน กรมสุขภาพจิต เป็นผู้มีสิทธิตามกฎหมายแต่ เพียงผู้เดียวใน กรรมสิทธิ์ ผลประโยชน์ทั้งหมด รวมถึงสิทธิในทรัพย์สินทางปัญญาใดๆ ที่มี อยู่ในบริการซึ่ง กลุ่มตรวจสอบภายใน กรมสุขภาพจิต หรือผู้ให้อนุญาตแก่กลุ่มตรวจสอบภายใน กรมสุขภาพจิต เป็นผู้จัดทำขึ้น ไม่ว่าสิทธิเหล่านั้นจะได้รับการจดทะเบียนไว้หรือไม่ก็ตาม </p>
<p class="pl-6">6.2 ผู้ใช้บริการจะต้องไม่เปิดเผยข้อมูลที่ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต กำหนดให้เป็นความลับ โดยไม่ได้รับความยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจาก สำนักยุทธศาสตร์สุขภาพจิต</p>
<p class="pl-6">6.3 ผู้ใช้บริการจะต้องไม่ใช้ชื่อทางการค้า เครื่องหมายการค้า เครื่องหมายการบริการ ตราสัญลักษณ์ ชื่อโดเมนของ กลุ่มตรวจสอบภายใน กรมสุขภาพจิต โดยไม่ได้รับความยินยอมเป็นลายลักษณ์อักษรจากสำนักยุทธศาสตร์สุขภาพจิต</p>
 <p class="text-content "></p>
<h2>7. กฎหมายที่ใช้บังคับ</h2>
<p class="pl-6">การตีความ และการบังคับตามเงื่อนไขการให้บริการฉบับนี้ ให้เป็นไปตามกฎหมายไทย </p>

</div>
@endsection